/* 
  auth {
    Сделать защиту при авторизации,
    Доработать авторизацию (добавить новые компоненты),
    Добавить выбор изображения при регистрации?,
    Сделать спинер загрузки при переходе в приложение,
    Сделать компонент с добавлением иконки пользователя при регистрации?,
    Создать "базу данных" пользователей,
    Передавать введенные данные в главный компонент (имя, иконка, роль?),
  }
*/

/* 
  main-leftbar {
    Доработать верстку быстрых настроек,
    Перерисовать все иконки,

    Сделать отдельные компоненты для приватных и групповых каналов,
    Сделать инпут для создания канала,
    Сделать закреп канала,
    Сделать дочерний роут (/main/options),
    При нажатии на иконку пользователя перекидывать в настройки аккаунта,
    Добавить уведомление при удалении канала,
    Вызывать уведомление при удалении канала в контекстном меню,
    Добавить доп логику для контекстного меню (покинуть канал и тд),
    Передавать данные о канале в райтбар при нажатии на название канала,

    main-leftbar-aside-menu {
      Добавить кнопки выключения звука/голоса,
      Заменить селект тем на иконки?,
    }

    main-leftbar-aside-notifi {
      Реализовать метод очистки уведомлений,
      Выделять иконку уведомлений, если их больше 0,
    }
  }
*/

/* 
  main-chat-section {
    Добавить методы из контекстного меню для манипуляции сообщениями (удалить, редактировать и тд),
    Добавить метод отправки сообщений (голос),
    Добавить эмодзи и их отображение в списке сообщений,
    Добавить прикрепление файлов и их отображение в списке сообщений,
    Открывать изображение на весь экран если оно есть в чате,
    Добавить перенос по словам в инпуте,
    Добавить установку фона,
    Добавить кнопку выхода из учетки в хедер?,
    Добавить кнопки управления к заголовку в хедере или в его конец (звонок, поиск и тд)?,
    Закрывать канал при нажатии на ESC,
    Добавить меню с выбором текста (курсив, жир, КОД и тд),
    Открывать райтбар при нажатии на имя пользователя в сообщении,
  }
*/

/* 
  main-rightbar {
    Доработать верстку,

    Добавить роут до настроек канала при нажатии на кнопку (если админ),
    Сделать контекстное меню при нажатии на участника канала (выгнать, написать и тд)
  }
*/

/* 
  options {
    Сверстать полноэкранные настройки, включая компоненты,
    Добавить Х для перехода в основное окно,
    Передавать в хедер текущую выбранную настройку,
    Изменить размер хедера как в мейне,
    Выделять активную "настроку",
  }
*/

/* 
  all {
    Добавить анимации во все компоненты,
    Сделать переключатель тем,
    Сделать 3 темы (светлая, темная и комбинированная),
    Дать нормальные названия классам во всех компонентах,
    Почистить комментарии,
    Сделать локальное хранилище данных,
    Почистить код и попытаться его оптимизировать,
    Привести все компоненты к единому виду,
    Добавить тень для контекстного меню?
  }
*/

/* 
  other {
    Добавить роли (админ, пользователь, модер) для управления каналами,
    Добавить горячие клавиши(сочетание с открытием уведомолений, быстрых настроек и тд),
    Сделать собственные селекты,
    Сделать собственные инпуты (радио, рендж и тд.)
  }
*/

/* 
  errors {
    Неизвестная ошибка связанная с райтбаром (инпут, оутпут) 
    Unchecked runtime.lastError: A listener indicated an asynchronous response by returning true, but the message channel closed before a response was received
  }
*/

/* 
  bugs {}
*/
